{
	"id": "oval:com.redhat.cve:def:202427316",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "httpd: CONTINUATION frames DoS (moderate)",
		"reference": [
			{
				"ref_id": "CVE-2024-27316",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2024-27316",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A vulnerability was found in how Apache httpd implements the HTTP/2 protocol. There are insufficient limitations placed on the amount of CONTINUATION frames that can be sent within a single stream. This issue could allow an unauthenticated remote attacker to send packets to vulnerable servers, which could use up memory resources to cause a Denial of Service. \n            STATEMENT: Red Hat rates the security impact of this vulnerability as Moderate, in alignment with upstream Apache. The worst case scenario is memory exhaustion causing a denial of service. Once an attack has ended, the system should return to normal operations on its own.\n\nThis vulnerability stems from an imperfect definition of the HTTP/2 protocol. As the httpd component is widely utilized across nearly every major Red Hat offering, a full listing of impacted packages will not be provided. Therefore, the “Affected Packages and Issued Red Hat Security Errata” section contains a simplified list of what offerings need to remediate this vulnerability. Every impacted offering has at least one representative component listed, but potentially not all of them. Rest assured that Red Hat is committed to remediating this vulnerability across our entire portfolio.\n            MITIGATION: Red Hat has investigated whether a possible mitigation exists for this issue, and has not been able to identify a practical example. Please update the affected package as soon as possible.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Moderate",
			"updated": {
				"date": "2024-04-13"
			},
			"cve": [
				{
					"text": "CVE-2024-27316",
					"cvss3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cwe": "CWE-400",
					"href": "https://access.redhat.com/security/cve/CVE-2024-27316",
					"impact": "moderate",
					"public": "20240403"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Affected",
						"component": [
							"HTTP-2"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:red_hat_single_sign_on:7",
					"cpe:/a:redhat:red_hat_single_sign_on:7::el6"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:201712161003",
						"comment": "Red Hat Enterprise Linux 6 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202427316001",
						"comment": "HTTP-2 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202427316002",
						"comment": "HTTP-2 is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:201712161004",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
