{
  "id": "oval:com.redhat.rhsa:def:20150442",
  "version": "646",
  "class": "patch",
  "metadata": {
    "title": "RHSA-2015:0442: ipa security, bug fix, and enhancement update (Moderate)",
    "reference": [
      {
        "ref_id": "RHSA-2015:0442",
        "ref_url": "https://access.redhat.com/errata/RHSA-2015:0442",
        "source": "RHSA"
      },
      {
        "ref_id": "CVE-2010-5312",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2010-5312",
        "source": "CVE"
      },
      {
        "ref_id": "CVE-2012-6662",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2012-6662",
        "source": "CVE"
      }
    ],
    "description": "Red Hat Identity Management (IdM) is a centralized authentication, identity management, and authorization solution for both traditional and cloud-based enterprise environments.\n\nTwo cross-site scripting (XSS) flaws were found in jQuery, which impacted the Identity Management web administrative interface, and could allow an authenticated user to inject arbitrary HTML or web script into the interface. (CVE-2010-5312, CVE-2012-6662)\n\nNote: The IdM version provided by this update no longer uses jQuery.\n\nThis update adds several enhancements that are described in more detail in the Red Hat Enterprise Linux 7.1 Release Notes, linked to in the References section, including:\n\n* Added the \"ipa-cacert-manage\" command, which renews the Certification Authority (CA) file. (BZ#886645)\n\n* Added the ID Views feature. (BZ#891984)\n\n* IdM now supports using one-time password (OTP) authentication and allows gradual migration from proprietary OTP solutions to the IdM OTP solution. (BZ#919228)\n\n* Added the \"ipa-backup\" and \"ipa-restore\" commands to allow manual backups. (BZ#951581)\n\n* Added a solution for regulating access permissions to specific sections of the IdM server. (BZ#976382)\n\nThis update also fixes several bugs, including:\n\n* Previously, when IdM servers were configured to require the Transport Layer Security protocol version 1.1 (TLSv1.1) or later in the httpd server, the \"ipa\" command-line utility failed. With this update, running \"ipa\" works as expected with TLSv1.1 or later. (BZ#1156466)\n\nIn addition, this update adds multiple enhancements, including:\n\n* The \"ipa-getkeytab\" utility can now optionally fetch existing keytabs from the KDC. Previously, retrieving an existing keytab was not supported, as the only option was to generate a new key. (BZ#1007367)\n\n* You can now create and manage a \".\" root zone on IdM servers. DNS queries sent to the IdM DNS server use this configured zone instead of the public zone. (BZ#1056202)\n\n* The IdM server web UI has been updated and is now based on the Patternfly framework, offering better responsiveness. (BZ#1108212)\n\n* A new user attribute now enables provisioning systems to add custom tags for user objects. The tags can be used for automember rules or for additional local interpretation. (BZ#1108229)\n\n* This update adds a new DNS zone type to ensure that forward and master zones are better separated. As a result, the IdM DNS interface complies with the forward zone semantics in BIND. (BZ#1114013)\n\n* This update adds a set of Apache modules that external applications can use to achieve tighter interaction with IdM beyond simple authentication. (BZ#1107555)\n\n* IdM supports configuring automember rules for automated assignment of users or hosts in respective groups according to their characteristics, such as the \"userClass\" or \"departmentNumber\" attributes. Previously, the rules could be applied only to new entries. This update allows applying the rules also to existing users or hosts. (BZ#1108226)\n\n* The extdom plug-in translates Security Identifiers (SIDs) of Active Directory (AD) users and groups to names and POSIX IDs. With this update, extdom returns the full member list for groups and the full list of group memberships for a user, the GECOS field, the home directory, as well as the login shell of a user. Also, an optional list of key-value pairs contains the SID of the requested object if the SID is available. (BZ#1030699)\n\nAll ipa users are advised to upgrade to these updated packages, which contain backported patches to correct these issues and add these enhancements.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Moderate",
      "updated": {
        "date": "2015-03-05"
      },
      "cve": [
        {
          "text": "CVE-2010-5312",
          "cwe": "CWE-79",
          "href": "https://access.redhat.com/security/cve/CVE-2010-5312",
          "impact": "moderate",
          "public": "20100903",
          "cvss2": "4.3/AV:N/AC:M/Au:N/C:N/I:P/A:N"
        },
        {
          "text": "CVE-2012-6662",
          "cwe": "CWE-79",
          "href": "https://access.redhat.com/security/cve/CVE-2012-6662",
          "impact": "moderate",
          "public": "20121127",
          "cvss2": "4.3/AV:N/AC:M/Au:N/C:N/I:P/A:N"
        }
      ],
      "affected": {},
      "affected_cpe_list": {
        "cpe": [
          "cpe:/o:redhat:rhel_eus:7.1",
          "cpe:/o:redhat:rhel_eus:7.1::computenode",
          "cpe:/o:redhat:rhel_eus:7.1::server"
        ]
      },
      "rights": "Copyright 2015 Red Hat, Inc.",
      "issued": {
        "date": "2015-03-05"
      },
      "bugzilla": [
        {
          "text": "CVE-2010-5312 jquery-ui: XSS vulnerability in jQuery.ui.dialog title option",
          "href": "https://bugzilla.redhat.com/1166041",
          "id": "1166041"
        },
        {
          "text": "CVE-2012-6662 jquery-ui: XSS vulnerability in default content in Tooltip widget",
          "href": "https://bugzilla.redhat.com/1166064",
          "id": "1166064"
        }
      ]
    },
    "affected": {
      "family": "unix",
      "platform": [
        "Red Hat Enterprise Linux 7"
      ]
    }
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterias": [
          {
            "operator": "OR",
            "criterias": [
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442001",
                    "comment": "ipa-admintools is earlier than 0:4.1.0-18.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442002",
                    "comment": "ipa-admintools is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442003",
                    "comment": "ipa-client is earlier than 0:4.1.0-18.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442004",
                    "comment": "ipa-client is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442005",
                    "comment": "ipa-python is earlier than 0:4.1.0-18.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442006",
                    "comment": "ipa-python is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442007",
                    "comment": "ipa-server is earlier than 0:4.1.0-18.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442008",
                    "comment": "ipa-server is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442009",
                    "comment": "ipa-server-trust-ad is earlier than 0:4.1.0-18.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20150442010",
                    "comment": "ipa-server-trust-ad is signed with Red Hat redhatrelease2 key"
                  }
                ]
              }
            ]
          }
        ],
        "criterions": [
          {
            "test_ref": "oval:com.redhat.rhba:tst:20150364027",
            "comment": "Red Hat Enterprise Linux 7 is installed"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.rhba:tst:20150364028",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
