{
  "id": "oval:com.redhat.cve:def:202240284",
  "version": "636",
  "class": "vulnerability",
  "metadata": {
    "title": "buffer overflow issue in NTFS-3G can cause code execution via crafted metadata in an NTFS image (low)",
    "reference": [
      {
        "ref_id": "CVE-2022-40284",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2022-40284",
        "source": "CVE"
      }
    ],
    "description": "DOCUMENTATION: A buffer overflow flaw was found in NTFS-3G.  This issue occurs via a crafted metadata in an NTFS image that can cause code execution. A local attacker can exploit this issue if the NTFS-3G binary is setuid root. A physically proximate attacker can exploit this issue if the NTFS-3G software is configured to execute upon attachment of an external storage device.\n\nAlso this vulnerability may allow an attacker using a maliciously crafted NTFS-formatted image file or external storage to potentially execute arbitrary privileged code, if the attacker has either local access and the ntfs-3g binary is setuid root, or if the attacker has physical access to an external port to a computer which is configured to run the ntfs-3g binary or one of the ntfsprogs tools when the external storage is plugged into the computer. This vulnerability results from incorrect validation of some of the NTFS metadata that could potentially cause buffer overflow, which could be exploited by an attacker. \n            STATEMENT: This flaw has a lower impact on Red Hat Enterprise Linux because the ntfs-3g tool is run in a supermin appliance, which is similar to a virtual machine instantiated on the fly, and it does not have the SUID bit set. Thus an attacker is very limited on what he can do to the vulnerable system.\n            MITIGATION: Mitigation for this issue is either not available or the currently available options don't meet the Red Hat Product Security criteria comprising ease of use and deployment, applicability to widespread installation base or stability.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Low",
      "updated": {
        "date": "2023-11-01"
      },
      "cve": [
        {
          "text": "CVE-2022-40284",
          "cvss3": "3.3/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:L",
          "cwe": "CWE-119->CWE-120",
          "href": "https://access.redhat.com/security/cve/CVE-2022-40284",
          "impact": "low",
          "public": "20221031"
        }
      ],
      "affected": {
        "resolution": [
          {
            "state": "Out of support scope",
            "component": [
              "libguestfs-winsupport"
            ]
          }
        ]
      },
      "affected_cpe_list": {
        "cpe": [
          "cpe:/a:redhat:rhel_extras:7",
          "cpe:/a:redhat:rhel_extras_oracle_java:7",
          "cpe:/a:redhat:rhel_extras_rt:7",
          "cpe:/a:redhat:rhel_extras_sap:7",
          "cpe:/a:redhat:rhel_extras_sap_hana:7",
          "cpe:/o:redhat:enterprise_linux:7",
          "cpe:/o:redhat:enterprise_linux:7::client",
          "cpe:/o:redhat:enterprise_linux:7::computenode",
          "cpe:/o:redhat:enterprise_linux:7::server",
          "cpe:/o:redhat:enterprise_linux:7::workstation"
        ]
      },
      "issued": {}
    },
    "affected": {}
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterions": [
          {
            "test_ref": "oval:com.redhat.cve:tst:20042779005",
            "comment": "Red Hat Enterprise Linux 7 is installed"
          },
          {
            "test_ref": "oval:com.redhat.cve:tst:202133285001",
            "comment": "libguestfs-winsupport is installed"
          },
          {
            "test_ref": "oval:com.redhat.cve:tst:202133285002",
            "comment": "libguestfs-winsupport is signed with Red Hat redhatrelease2 key"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.cve:tst:20042779006",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
