{
	"id": "oval:com.redhat.cve:def:202423652",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "moby/buildkit: possible host system access from mount stub cleaner (low)",
		"reference": [
			{
				"ref_id": "CVE-2024-23652",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2024-23652",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A vulnerability was found in the Moby Builder Toolkit, which arose from BuildKit's attempts to clean up temporarily added directories after use. A malicious BuildKit frontend or Dockerfile using RUN --mount could deceive the feature responsible for removing empty files created for the mount points, potentially leading to removing a file outside the container and affecting the host system. Successful exploitation of this issue may result in the arbitrary deletion of files and directories on the underlying host OS when building an image using a malicious Dockerfile or upstream image (for example, when using FROM). \n            STATEMENT: The following are preconditions for exploiting this vulnerability:\n* A container is built using a Dockerfile\n        OR\n* A BuildKit frontend is invoked with the RUN --mount command\n\n\nAdditionally, for the cleanup operations to impact the host file system the parent of the target directory needs to be replaced with a symbolic link during the build container's lifetime. For these reasons, this flaw was rated with an important severity.\n\nSome offerings (Notably Red Hat Enterprise Linux and Red Hat OpenShift Container Platform) include functionality that mimics certain BuildKit features via the Buildah package. However, within Buildah these temporary mount targets are consistently removed by a subprocess running in a chroot; this effectively prevents exploitation of this vulnerability. Therefore the impact for offerings which include BuildKit via Buildah are rated Low.\n\nFor multicluster-engine (MCE) vulnerable versions of buildkit and runc are part of installed version of oc. However, they are not affecting the higher-level assisted-installer binary in MCE. The presence of these dependencies in the container does not imply a security risk to the containerized application itself, as it is based on low-level packages included in the oc binary, and the impact to the container's core functionality is minimal.\n            MITIGATION: Do not use BuildKit frontends or Dockerfiles from untrusted sources.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Low",
			"updated": {
				"date": "2024-10-07"
			},
			"cve": [
				{
					"text": "CVE-2024-23652",
					"cvss3": "7.8/CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:H",
					"cwe": "CWE-22",
					"href": "https://access.redhat.com/security/cve/CVE-2024-23652",
					"impact": "low",
					"public": "20240131"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Out of support scope",
						"component": [
							"buildah"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:rhel_extras:7",
					"cpe:/a:redhat:rhel_extras_oracle_java:7",
					"cpe:/a:redhat:rhel_extras_rt:7",
					"cpe:/a:redhat:rhel_extras_sap:7",
					"cpe:/a:redhat:rhel_extras_sap_hana:7",
					"cpe:/o:redhat:enterprise_linux:7",
					"cpe:/o:redhat:enterprise_linux:7::client",
					"cpe:/o:redhat:enterprise_linux:7::computenode",
					"cpe:/o:redhat:enterprise_linux:7::server",
					"cpe:/o:redhat:enterprise_linux:7::workstation"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:20042779005",
						"comment": "Red Hat Enterprise Linux 7 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202120206001",
						"comment": "buildah is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202120206002",
						"comment": "buildah is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:20042779006",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
