{
	"id": "oval:com.redhat.cve:def:20249050",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "NetworkManager-libreswan: Local privilege escalation via leftupdown (important)",
		"reference": [
			{
				"ref_id": "CVE-2024-9050",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2024-9050",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A flaw was found in the libreswan client plugin for NetworkManager (NetkworkManager-libreswan), where it fails to properly sanitize the VPN configuration from the local unprivileged user. In this configuration, composed by a key-value format, the plugin fails to escape special characters, leading the application to interpret values as keys. One of the most critical parameters that could be abused by a malicious user is the `leftupdown`key. This key takes an executable command as a value and is used to specify what executes as a callback in NetworkManager-libreswan to retrieve configuration settings back to NetworkManager. As NetworkManager uses Polkit to allow an unprivileged user to control the system's network configuration, a malicious actor could achieve local privilege escalation and potential code execution as root in the targeted machine. \n            STATEMENT: This issue marked with an Important severity due to its potential to enable local privilege escalation and arbitrary code execution. Since NetworkManager uses Polkit to allow unprivileged users to manage network configurations, the failure to properly sanitize the VPN configuration, particularly the `leftupdown` key, creates a direct attack vector. By leveraging this vulnerability, an attacker can inject malicious commands into the VPN configuration, bypassing user privilege boundaries and gaining root access.\n            MITIGATION: A mitigation for this issue is either unavailable or the existing options do not meet Red Hat Product Security's standards for ease of use, deployment, widespread applicability, or stability. \n\nOne potential approach is to prevent local users from controlling networking through polkit. However, this would also block them from connecting to new Wi-Fi networks, which is not ideal for laptops but might be acceptable for workstations. Server customers typically don't need to be concerned, as they generally don't have local users capable of exploiting the bug.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Important",
			"updated": {
				"date": "2024-10-22"
			},
			"cve": [
				{
					"text": "CVE-2024-9050",
					"cvss3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"href": "https://access.redhat.com/security/cve/CVE-2024-9050",
					"impact": "important",
					"public": "20241022:1200"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Affected",
						"component": [
							"NetworkManager-libreswan",
							"NetworkManager-libreswan-gnome"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:rhel_extras:7",
					"cpe:/a:redhat:rhel_extras_oracle_java:7",
					"cpe:/a:redhat:rhel_extras_rt:7",
					"cpe:/a:redhat:rhel_extras_sap:7",
					"cpe:/a:redhat:rhel_extras_sap_hana:7",
					"cpe:/o:redhat:enterprise_linux:7",
					"cpe:/o:redhat:enterprise_linux:7::client",
					"cpe:/o:redhat:enterprise_linux:7::computenode",
					"cpe:/o:redhat:enterprise_linux:7::server",
					"cpe:/o:redhat:enterprise_linux:7::workstation"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterias": [
					{
						"operator": "OR",
						"criterias": [
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.cve:tst:20249050001",
										"comment": "NetworkManager-libreswan-gnome is installed"
									},
									{
										"test_ref": "oval:com.redhat.cve:tst:20249050002",
										"comment": "NetworkManager-libreswan-gnome is signed with Red Hat redhatrelease2 key"
									}
								]
							},
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.cve:tst:20249050003",
										"comment": "NetworkManager-libreswan is installed"
									},
									{
										"test_ref": "oval:com.redhat.cve:tst:20249050004",
										"comment": "NetworkManager-libreswan is signed with Red Hat redhatrelease2 key"
									}
								]
							}
						]
					}
				],
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:20042779005",
						"comment": "Red Hat Enterprise Linux 7 is installed"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:20042779006",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
