{
  "id": "oval:com.redhat.rhsa:def:20162778",
  "version": "649",
  "class": "patch",
  "metadata": {
    "title": "RHSA-2016:2778: atomic-openshift-utils security and bug fix update (Moderate)",
    "reference": [
      {
        "ref_id": "RHSA-2016:2778",
        "ref_url": "https://access.redhat.com/errata/RHSA-2016:2778",
        "source": "RHSA"
      },
      {
        "ref_id": "CVE-2016-8628",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2016-8628",
        "source": "CVE"
      }
    ],
    "description": "Red Hat OpenShift Container Platform is the company's cloud computing Platform-as-a-Service (PaaS) solution designed for on-premise or private cloud deployments.\n\nSecurity Fix(es):\n\n* Ansible fails to properly sanitize fact variables sent from the Ansible controller. An attacker with the ability to create special variables on the controller could execute arbitrary commands on Ansible clients as the user Ansible runs as. (CVE-2016-8628)\n\nThis issue was discovered by Michael Scherer (Red Hat).\n\nBug Fix(es):\n\n* Previous versions of the openshift-ansible code base were not compatible with the latest Ansible 2.2.0.0 release. This bug fix resolves several compatibility issues with the GA version of Ansible 2.2.0.0. (BZ#1389928) (BZ#1389275)\n\n* The hosts.ose.example inventory file had the incorrect openshift_release version set. This bug fix updates the version to match the channel in which it is shipped. (BZ#1386333)\n\n* The etcd certificate authority created by the installer had an expiry date one year in the future. With this bug fix, the expiry date has been updated to five years, matching the lifespan of other certificate authorities created by the installer. (BZ#1391548)\n\n* After restarting systemd-journal, master controllers and API services stopped working. This bug fix updates the installer to set Restart=always for the master controllers and API services, and this issue no longer occurs for new installations. For existing clusters, see https://access.redhat.com/solutions/2749571. (BZ#1378929)\n\n* When using the quick installer to install a cluster with a single master, the installer messaging suggested that an embedded etcd would be deployed. In newer versions of the quick installer, this is no longer the case, and a stand-alone etcd datastore is deployed in this scenario. This bug fix updates the quick installer messaging to match those changes. (BZ#1383961)\n\n* Upgrades would fail if the /etc/ansible/facts.d/openshift.fact cache was missing on the system, particularly for co-located master and etcd hosts. This bug fix improves etcd fact checking during upgrades, and the issue no longer occurs. (BZ#1391608)\n\n* Containerized upgrades from OpenShift Container Platform 3.2 to 3.3 would fail to properly create the service signing certificate due to an invalid path being used in containerized environments. This bug fix corrects that error, and containerized upgrades now create service signer certificates as a result. (BZ#1391865)\n\n* Upgrades from OpenShift Container Platform 3.2 to 3.3 could fail with the error \"AnsibleUndefinedVariable: 'dict object' has no attribute 'debug_level'\". This bug fix sets missing defaults for debug_level, and as a result the upgrade error no longer occurs. (BZ#1392276)\n\n* Previously in embedded environments, etcd 2.x was used to backup the etcd data before performing an upgrade. However, etcd 2.x has a bug that prevents backups from working properly, preventing the upgrade playbooks from running to completion. With this bug fix, etcd 3.0 is now installed for embedded etcd environments, which resolves the bug allowing upgrades to proceed normally. This bug only presents itself when using the embedded etcd service on single master environments. (BZ#1382634)\n\n* Pacemaker clusters are no longer supported, but related code that remained could in some cases cause upgrade failures. This bug fix removes the Pacemaker restart logic from the installer to avoid these issues. (BZ#1382936)\n\n* Previously, upgrades from OpenShift Container Platform 3.1 to 3.2 could fail due to erroneous host names being added for etcd hosts during backup. This bug fix addresses issues with conditionals and loops in templates that caused this problem, and as a result the upgrade errors no longer occur. (BZ#1392169)\n\nAll OpenShift Container Platform users are advised to upgrade to these updated packages.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Moderate",
      "updated": {
        "date": "2016-11-15"
      },
      "cve": [
        {
          "text": "CVE-2016-8628",
          "cvss3": "7.6/CVSS:3.0/AV:N/AC:H/PR:H/UI:R/S:C/C:H/I:H/A:H",
          "cwe": "CWE-77",
          "href": "https://access.redhat.com/security/cve/CVE-2016-8628",
          "impact": "moderate",
          "public": "20161101",
          "cvss2": "6.8/AV:N/AC:M/Au:N/C:P/I:P/A:P"
        }
      ],
      "affected": {},
      "affected_cpe_list": {
        "cpe": [
          "cpe:/a:redhat:openshift:3.2",
          "cpe:/a:redhat:openshift:3.2::el7"
        ]
      },
      "rights": "Copyright 2016 Red Hat, Inc.",
      "issued": {
        "date": "2016-11-15"
      },
      "bugzilla": [
        {
          "text": "CVE-2016-8628 ansible: Command injection by compromised server via fact variables",
          "href": "https://bugzilla.redhat.com/1388113",
          "id": "1388113"
        }
      ]
    },
    "affected": {
      "family": "unix",
      "platform": [
        "Red Hat OpenShift Container Platform 3.2"
      ]
    }
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterias": [
          {
            "operator": "OR",
            "criterias": [
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778001",
                    "comment": "ansible is earlier than 0:2.2.0.0-1.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778002",
                    "comment": "ansible is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778003",
                    "comment": "atomic-openshift-utils is earlier than 0:3.2.42-1.git.0.6b09be9.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20161853026",
                    "comment": "atomic-openshift-utils is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778005",
                    "comment": "openshift-ansible is earlier than 0:3.2.42-1.git.0.6b09be9.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20161853028",
                    "comment": "openshift-ansible is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778007",
                    "comment": "openshift-ansible-docs is earlier than 0:3.2.42-1.git.0.6b09be9.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20161853030",
                    "comment": "openshift-ansible-docs is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778009",
                    "comment": "openshift-ansible-filter-plugins is earlier than 0:3.2.42-1.git.0.6b09be9.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20161853032",
                    "comment": "openshift-ansible-filter-plugins is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778011",
                    "comment": "openshift-ansible-lookup-plugins is earlier than 0:3.2.42-1.git.0.6b09be9.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20161853034",
                    "comment": "openshift-ansible-lookup-plugins is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778013",
                    "comment": "openshift-ansible-playbooks is earlier than 0:3.2.42-1.git.0.6b09be9.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20161853036",
                    "comment": "openshift-ansible-playbooks is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20162778015",
                    "comment": "openshift-ansible-roles is earlier than 0:3.2.42-1.git.0.6b09be9.el7"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20161853038",
                    "comment": "openshift-ansible-roles is signed with Red Hat redhatrelease2 key"
                  }
                ]
              }
            ]
          }
        ],
        "criterions": [
          {
            "test_ref": "oval:com.redhat.rhba:tst:20161343025",
            "comment": "Red Hat Enterprise Linux 7 is installed"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.rhba:tst:20161343026",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
