{
	"id": "oval:com.redhat.cve:def:20221292",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2022-1292 openssl: c_rehash script allows command injection (moderate)",
		"reference": [
			{
				"ref_id": "CVE-2022-1292",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2022-1292",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A flaw was found in OpenSSL. The `c_rehash` script does not properly sanitize shell meta-characters to prevent command injection. Some operating systems distribute this script in a manner where it is automatically executed. This flaw allows an attacker to execute arbitrary commands with the privileges of the script on these operating systems. \n            STATEMENT: Red Hat Enterprise Linux uses a system-wide store of trusted certificates bundled in a single file and updated via `update-ca-trust`. The `c_rehash` script is not included in the default installation on any supported RHEL version, and is never executed automatically. For these reasons, this flaw has been rated as having a security impact of Moderate.\n\nRed Hat Enterprise Linux 7 provides a vulnerable version of the `c_rehash` script in the `openssl-perl` package, available only through the unsupported Optional repository.  As the Optional repository is not supported and Red Hat Enterprise Linux 7 is in Maintenance Support 2 Phase, this issue is not planned to be addressed there.\n\nRed Hat Satellite ships an affected version of the `c_rehash` script embedded in `puppet-agent` package, however, the product is not vulnerable since it does not execute scripts with untrusted data. Moreover, the scriplet is owned by root user and is supposed to be accessed only by administrators.\n\nRed Hat updates the OpenSSL compatibility packages (compat-openssl) to only address Important or Critical security issues with backported security patches.\n            MITIGATION: As mentioned in the upstream security advisory, use of the c_rehash script is considered obsolete and should be replaced by the OpenSSL rehash command line tool.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Moderate",
			"updated": {
				"date": "2022-09-03"
			},
			"cve": [
				{
					"text": "CVE-2022-1292",
					"cvss3": "6.7/CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H",
					"cwe": "CWE-77",
					"href": "https://access.redhat.com/security/cve/CVE-2022-1292",
					"impact": "moderate",
					"public": "20220503"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Affected",
						"component": [
							"puppet-agent"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:rhel_satellite_tools:6.9",
					"cpe:/a:redhat:rhel_satellite_tools:6.9::el8",
					"cpe:/a:redhat:rhel_satellite_tools:8"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:20162166005",
						"comment": "Red Hat Enterprise Linux 8 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:201710690001",
						"comment": "puppet-agent is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:201710690002",
						"comment": "puppet-agent is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:20162166006",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
