{
	"id": "oval:com.redhat.cve:def:202127290",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "Regular expression DoS (ReDoS) when parsing malicious SRI in strict mode (low)",
		"reference": [
			{
				"ref_id": "CVE-2021-27290",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2021-27290",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A flaw was found in ssri package. A malicious string provided by an attacker may lead to Regular Expression Denial of Service (ReDoS). This issue only affects consumers\nusing the strict option. The highest threat from this vulnerability is to availability. \n            STATEMENT: Whilst the OpenShift ServiceMesh (OSSM) servicemesh-grafana and servicemesh-prometheus include the vulnerable ssri library, the vulnerable \"strict\" option is not used. Similar to OSSM, OpenShift Container Platform (OCP), Red Hat Advance Cluster Management for Kubernetes (RHACM) and OpenShift distributed tracing components include the vulnerable ssri library but the \"strict\" option is not used. Additionally access to the vulnerable library is protected by OpenShift OAuth what reducing impact by this flaw to LOW. Therefore these OSSM, OCP, RHACM and OpenShift distributed tracing components have been marked as wont-fix and may be addressed in a future updates.\n\nRed Hat Virtualization includes ssri in cockpit-ovirt, ovirt-web-ui and ovirt-engine-ui-extensions, but the vulnerable \"strict\" option is not used. Additionally access to the vulnerable library is protected by RHV authentication. Therefore  the impact of this flaw for RHV has been reduced to LOW and components have been marked as wont-fix and may be addressed in a future update.\n\nRed Hat Quay includes ssri as a dependency of webpack which is only used at build time. The library is not used at runtime, reducing the impact of this vulnerability to low.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Low",
			"updated": {
				"date": "2023-08-31"
			},
			"cve": [
				{
					"text": "CVE-2021-27290",
					"cvss3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cwe": "CWE-770",
					"href": "https://access.redhat.com/security/cve/CVE-2021-27290",
					"impact": "low",
					"public": "20210312"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Will not fix",
						"component": [
							"ovirt-engine-ui-extensions",
							"ovirt-web-ui"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:rhev_manager:4.4",
					"cpe:/a:redhat:rhev_manager:4.4:el8"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterias": [
					{
						"operator": "OR",
						"criterias": [
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.cve:tst:202123362001",
										"comment": "ovirt-engine-ui-extensions is installed"
									},
									{
										"test_ref": "oval:com.redhat.cve:tst:202123362002",
										"comment": "ovirt-engine-ui-extensions is signed with Red Hat redhatrelease2 key"
									}
								]
							},
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.cve:tst:202123343001",
										"comment": "ovirt-web-ui is installed"
									},
									{
										"test_ref": "oval:com.redhat.cve:tst:202123343002",
										"comment": "ovirt-web-ui is signed with Red Hat redhatrelease2 key"
									}
								]
							}
						]
					}
				],
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:20166341003",
						"comment": "Red Hat Enterprise Linux 8 is installed"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:20166341004",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
