{
	"id": "oval:com.redhat.cve:def:202328450",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "dnsmasq: default maximum EDNS.0 UDP packet size was set to 4096 but should be 1232 (moderate)",
		"reference": [
			{
				"ref_id": "CVE-2023-28450",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2023-28450",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A flaw was found in Dnsmasq. The default maximum EDNS.0 UDP packet size was set to 4096 but should be 1232 because of DNS Flag Day 2020. \n            STATEMENT: The severity of this vulnerability is not important but moderate because exploiting the vulnerability can lead to a theoretical disruption of the availability of the service, but doesn’t directly compromise data integrity or confidentiality. This theoretical disruption would require an attacker to be able to induce IP fragmentation during transmission and can be mitigated with a simple configuration change in any affected version. A successful attack would require significant target specific preparation and the ability to act as a man-in-the-middle or control the path MTU of the authoritative DNS server. Additionally, this CVE is easily remediated by setting the edns-packet-max value to 1232 in the dnsmasq configuration.\n\nThe changes made for DNS Flag Day 2020 were primarily related to improving service reliability in order to make sure that DNS servers do not experience transmission failures due to IP fragmentation over networks of unknown MTU configurations. This change of the default maximum EDNS Buffer Size was coordinated so that default configurations of DNS services would provide more reliable default settings as well as avoid attacks on DNS services that can only be made possible when UDP packets are fragmented in transit. For example, if the DNS Query ID and UDP port are carried in the first IP fragment, an attacker could spoof the second fragment and poison the DNS cache by swapping the subsequent good IP fragments with their own. \n\nBy using a default maximum EDNS value of 1232 (the largest value found to avoids fragmentation on nearly all modern networks) and relying on TCP for DNS queries with larger responses, IP Fragmentation issues can be reliably avoided with the default dnsmasq configuration.\n            MITIGATION: Systems that can not be updated can still configure dnsmasq to use the recommended maximum EDNS value by setting edns-packet-max=1232 in the dnsmasq configuration.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Moderate",
			"updated": {
				"date": "2024-05-23"
			},
			"cve": [
				{
					"text": "CVE-2023-28450",
					"cvss3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cwe": "CWE-770",
					"href": "https://access.redhat.com/security/cve/CVE-2023-28450",
					"impact": "moderate",
					"public": "20230315"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Out of support scope",
						"component": [
							"dnsmasq-utils"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:openstack-optools:13",
					"cpe:/a:redhat:openstack-optools:13::el7",
					"cpe:/a:redhat:openstack:13",
					"cpe:/a:redhat:openstack:13::el7"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:20115034003",
						"comment": "Red Hat Enterprise Linux 7 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:201914834001",
						"comment": "dnsmasq-utils is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:201914834002",
						"comment": "dnsmasq-utils is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:20115034004",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
