{
	"id": "oval:com.redhat.cve:def:202327561",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "runc: volume mount race condition (regression of CVE-2019-19921) (moderate)",
		"reference": [
			{
				"ref_id": "CVE-2023-27561",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2023-27561",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A flaw was found in runc. An attacker who controls the container image for two containers that share a volume can race volume mounts during container initialization by adding a symlink to the rootfs that points to a directory on the volume. \n            STATEMENT: The vulnerability in runc, related to Incorrect Access Control in libcontainer/rootfs_linux.go, is classified as a moderate severity issue due to its prerequisites for exploitation and the level of access required by an attacker. To exploit this vulnerability, an attacker must have the capability to spawn two containers with custom volume-mount configurations and execute custom images within these containers. This restricts the attack vector to scenarios where an attacker already has a certain level of access to the container environment. Additionally, the vulnerability leads to an escalation of privileges, potentially allowing an attacker to gain elevated permissions on the host system. While the impact of privilege escalation is significant, the specific conditions required for successful exploitation mitigate the overall severity to moderate. \n\nThis CVE exists because of a CVE-2019-19921 regression.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Moderate",
			"updated": {
				"date": "2024-12-06"
			},
			"cve": [
				{
					"text": "CVE-2023-27561",
					"cvss3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
					"cwe": "CWE-41",
					"href": "https://access.redhat.com/security/cve/CVE-2023-27561",
					"impact": "moderate",
					"public": "20230220"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Out of support scope",
						"component": [
							"runc"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:rhel_extras_other:7"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:20140047029",
						"comment": "Red Hat Enterprise Linux 7 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202144717001",
						"comment": "runc is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202144717002",
						"comment": "runc is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:20140047030",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
