{
	"id": "oval:com.redhat.cve:def:20208555",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2020-8555 kubernetes: Server side request forgery (SSRF) in kube-controller-manager allows users to leak secret information (moderate)",
		"reference": [
			{
				"ref_id": "CVE-2020-8555",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2020-8555",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A server side request forgery (SSRF) flaw was found in Kubernetes. The kube-controller-manager allows authorized users with the ability to create StorageClasses or certain Volume types to leak up to 500 bytes of arbitrary information from the master's host network. This can include secrets from the kube-apiserver through the unauthenticated localhost port (if enabled). \n            STATEMENT: OpenShift Container Platform does not expose kube-apiserver through an unauthenticated localhost port. However, other link-local addresses are reachable without authentication that allow an attacker to access sensitive data.\n\nThe version of heketi shipped with Red Hat Gluster Storage 3 includes the affected client side code for heketi and quobyte volume plugin, however the vulnerable functionality is currently not used by the product and hence this issue has been rated as having a security impact of Low.\n\nRed Hat Openshift Container Storage 4.2 is not affected by this vulnerability as rook-ceph-operator container does not include support for affected volume plugins(storageos, scaleio, glusterfs, quobyte).\n            MITIGATION: Restrict use of the vulnerable volume type and restrict StorageClass write permissions via RBAC",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Moderate",
			"updated": {
				"date": "2021-02-16"
			},
			"cve": [
				{
					"text": "CVE-2020-8555",
					"cvss3": "6.3/CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N",
					"cwe": "CWE-200",
					"href": "https://access.redhat.com/security/cve/CVE-2020-8555",
					"impact": "moderate",
					"public": "20200601"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Affected",
						"component": [
							"openshift"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:openshift:4.12",
					"cpe:/a:redhat:openshift:4.12::el9"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:20143577003",
						"comment": "Red Hat Enterprise Linux 9 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:201718367001",
						"comment": "openshift is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:201718367002",
						"comment": "openshift is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:20143577004",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
