{
	"id": "oval:com.redhat.cve:def:20246119",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "openssl: Possible denial of service in X.509 name checks (moderate)",
		"reference": [
			{
				"ref_id": "CVE-2024-6119",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2024-6119",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A flaw was found in OpenSSL. Applications performing certificate name checks, for example, TLS clients checking server certificates, may attempt to read an invalid memory address, resulting in abnormal termination of the application process. \n            STATEMENT: This vulnerability is classified as moderate severity rather than important because it primarily affects specific use cases involving certificate name checks against otherName subject alternative names, a scenario that is not commonly encountered. The issue only triggers a denial of service (DoS) by causing an abnormal application termination, without compromising the integrity, confidentiality, or availability of data at a broader scale. Additionally, TLS servers, which typically don't perform reference identity checks during client certificate validation, are largely unaffected. The impact is localized to certain TLS clients performing specific name comparisons, reducing the overall risk profile and justifying the moderate severity classification.\n            MITIGATION: Mitigation for this issue is either not available or the currently available options do not meet the Red Hat Product Security criteria comprising ease of use and deployment, applicability to widespread installation base or stability.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Moderate",
			"updated": {
				"date": "2024-09-04"
			},
			"cve": [
				{
					"text": "CVE-2024-6119",
					"cvss3": "5.9/CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cwe": "CWE-843",
					"href": "https://access.redhat.com/security/cve/CVE-2024-6119",
					"impact": "moderate",
					"public": "20240904"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Affected",
						"component": [
							"rhcos"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:openshift:4.17",
					"cpe:/a:redhat:openshift:4.17::el9"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:201714623003",
						"comment": "Red Hat Enterprise Linux 9 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202345918001",
						"comment": "rhcos is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202345918002",
						"comment": "rhcos is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:201714623004",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
