{
	"id": "oval:com.redhat.cve:def:202123368",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "nodejs-postcss: Regular expression denial of service during source map parsing (low)",
		"reference": [
			{
				"ref_id": "CVE-2021-23368",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2021-23368",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A regular expression denial of service (ReDoS) vulnerability was found in the npm library `postcss`. When parsing a supplied CSS string, if it contains an unexpected value then as the supplied CSS grows in length it will take an ever increasing amount of time to process. An attacker can use this vulnerability to potentially craft a malicious a long CSS value to process resulting in a denial of service. \n            STATEMENT: In Red Hat OpenShift Container Platform (RHOCP), OpenShift ServiceMesh (OSSM) and Red Hat Advanced Cluster Management for Kubernetes (RHACM) the affected containers are behind OpenShift OAuth authentication. This restricts access to the vulnerable nodejs-postcss library to authenticated users only, therefore the impact is low.\n\nRed Hat OpenShift Container Platform 4 delivers the kibana package where the nodejs-postcss library is used, but due to the code changing to the container first content the kibana package is marked as wontfix. This may be fixed in the future.\n\nIn Red Had Quay , whilst a vulnerable version of `postcss` is included in the quay-rhel8 container it is a development dependency only, therefor the impact is low.\n\nIn Red Hat Virtualization a vulnerable version of postcss is used in cockpit-ovirt, ovirt-web-ui and ovirt-engine-ui-extensions. However, it is only used during development and is used to process known CSS content. This flaw has been marked as \"wontfix\" and it may be addressed in future updates.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Low",
			"updated": {
				"date": "2023-08-31"
			},
			"cve": [
				{
					"text": "CVE-2021-23368",
					"cvss3": "5.3/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L",
					"cwe": "CWE-400",
					"href": "https://access.redhat.com/security/cve/CVE-2021-23368",
					"impact": "low",
					"public": "20210412"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Will not fix",
						"component": [
							"kibana"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:openshift:4.18",
					"cpe:/a:redhat:openshift:4.18::el9"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:201714623003",
						"comment": "Red Hat Enterprise Linux 9 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:201816487001",
						"comment": "kibana is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:201816487002",
						"comment": "kibana is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:201714623004",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
