{
	"id": "oval:com.redhat.cve:def:20241737",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "bind: bind9: BIND's database will be slow if a very large number of RRs exist at the same nam (important)",
		"reference": [
			{
				"ref_id": "CVE-2024-1737",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2024-1737",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A flaw was found in the bind9 package, where a hostname with significant resource records may slow down bind's resolver cache and authoritative zone databases while these records are being added or updated. In addition, client queries for the related hostname may cause the same issue. This vulnerability may lead to a denial of service. \n            STATEMENT: The identified flaw in the bind9 package represents a significant severity issue due to its potential to disrupt DNS resolution services. Specifically, a hostname with an extensive number of resource records can substantially degrade the performance of bind's resolver cache and authoritative zone databases. This degradation occurs during the addition or updating of these records, and is further exacerbated by client queries, which can lead to resource exhaustion. Consequently, the system may experience increased latency or complete unavailability of DNS services, resulting in a Denial of Service (DoS).\n\nThe DHCP package as shipped with Red Hat Enterprise 9 is not affected by this vulnerability. Although the DHCP binary ships bundled versions of bind libraries, the DHCP application uses its own routines to DDNS and configuration meaning the affected code is not reachable through it.\n            MITIGATION: Mitigation for this issue is either not available or the currently available options do not meet the Red Hat Product Security criteria comprising ease of use and deployment, applicability to widespread installation base or stability.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Important",
			"updated": {
				"date": "2024-11-15"
			},
			"cve": [
				{
					"text": "CVE-2024-1737",
					"cvss3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
					"cwe": "CWE-400",
					"href": "https://access.redhat.com/security/cve/CVE-2024-1737",
					"impact": "important",
					"public": "20240723"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Affected",
						"component": [
							"rhcos"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:openshift:4.18",
					"cpe:/a:redhat:openshift:4.18::el9"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:201714623003",
						"comment": "Red Hat Enterprise Linux 9 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202345918001",
						"comment": "rhcos is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202345918002",
						"comment": "rhcos is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:201714623004",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
