{
	"id": "oval:com.redhat.cve:def:202350780",
	"version": "636",
	"class": "vulnerability",
	"metadata": {
		"title": "artemis: Apache ActiveMQ Artemis: Authenticated users could perform RCE via Jolokia MBeans (important)",
		"reference": [
			{
				"ref_id": "CVE-2023-50780",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2023-50780",
				"source": "CVE"
			}
		],
		"description": "DOCUMENTATION: A flaw was found in Apache ActiveMQ Artemis. Affected versions of this package allow access to diagnostic information and controls through MBeans, which are also exposed through the authenticated Jolokia endpoint. This also included the Log4J2 MBean. This MBean is not meant for exposure to non-administrative users. This issue could eventually allow an authenticated attacker to write arbitrary files to the filesystem and indirectly achieve RCE. \n            STATEMENT: This vulnerability is considered Important rather than Critical because, while it does allow an authenticated attacker to exploit exposed MBeans (such as the Log4J2 MBean) to write arbitrary files, the exploit path requires prior authentication. The attacker must have valid credentials to access the Jolokia endpoint, limiting the attack's scope to already-compromised or insider-threat scenarios. Additionally, successful exploitation requires specific conditions, such as controlling the file's content in a way that leads to code execution, which is not guaranteed.\n            MITIGATION: Mitigation for this issue is either not available or the currently available options do not meet the Red Hat Product Security criteria comprising ease of use and deployment, applicability to widespread installation base or stability.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Important",
			"updated": {
				"date": "2024-10-15"
			},
			"cve": [
				{
					"text": "CVE-2023-50780",
					"cvss3": "8.2/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N",
					"cwe": "CWE-285",
					"href": "https://access.redhat.com/security/cve/CVE-2023-50780",
					"impact": "important",
					"public": "20241014:1603"
				}
			],
			"affected": {
				"resolution": [
					{
						"state": "Affected",
						"component": [
							"org.apache.activemq/artemis-cli"
						]
					}
				]
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:red_hat_single_sign_on:7.6",
					"cpe:/a:redhat:red_hat_single_sign_on:7.6::el9"
				]
			},
			"issued": {}
		},
		"affected": {}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.cve:tst:201712161003",
						"comment": "Red Hat Enterprise Linux 9 is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202350780001",
						"comment": "org.apache.activemq/artemis-cli is installed"
					},
					{
						"test_ref": "oval:com.redhat.cve:tst:202350780002",
						"comment": "org.apache.activemq/artemis-cli is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.cve:tst:201712161004",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
